{"class_name": "Model", "config": {"name": "model_7", "layers": [{"name": "img_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 128, 224, 3], "dtype": "float32", "sparse": false, "name": "img_input"}, "inbound_nodes": []}, {"name": "conv2d_720", "class_name": "Conv2D", "config": {"name": "conv2d_720", "trainable": true, "filters": 24, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["img_input", 0, 0, {}]]]}, {"name": "batch_normalization_715", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_715", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_720", 0, 0, {}]]]}, {"name": "activation_715", "class_name": "Activation", "config": {"name": "activation_715", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_715", 0, 0, {}]]]}, {"name": "conv2d_721", "class_name": "Conv2D", "config": {"name": "conv2d_721", "trainable": true, "filters": 48, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_715", 0, 0, {}]]]}, {"name": "batch_normalization_716", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_716", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_721", 0, 0, {}]]]}, {"name": "activation_716", "class_name": "Activation", "config": {"name": "activation_716", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_716", 0, 0, {}]]]}, {"name": "conv2d_722", "class_name": "Conv2D", "config": {"name": "conv2d_722", "trainable": true, "filters": 12, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_716", 0, 0, {}]]]}, {"name": "dropout_386", "class_name": "Dropout", "config": {"name": "dropout_386", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["conv2d_722", 0, 0, {}]]]}, {"name": "concatenate_322", "class_name": "Concatenate", "config": {"name": "concatenate_322", "trainable": true, "axis": -1}, "inbound_nodes": [[["dropout_386", 0, 0, {}], ["conv2d_720", 0, 0, {}]]]}, {"name": "batch_normalization_717", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_717", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concatenate_322", 0, 0, {}]]]}, {"name": "activation_717", "class_name": "Activation", "config": {"name": "activation_717", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_717", 0, 0, {}]]]}, {"name": "conv2d_723", "class_name": "Conv2D", "config": {"name": "conv2d_723", "trainable": true, "filters": 48, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_717", 0, 0, {}]]]}, {"name": "batch_normalization_718", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_718", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_723", 0, 0, {}]]]}, {"name": "activation_718", "class_name": "Activation", "config": {"name": "activation_718", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_718", 0, 0, {}]]]}, {"name": "conv2d_724", "class_name": "Conv2D", "config": {"name": "conv2d_724", "trainable": true, "filters": 12, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_718", 0, 0, {}]]]}, {"name": "dropout_387", "class_name": "Dropout", "config": {"name": "dropout_387", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["conv2d_724", 0, 0, {}]]]}, {"name": "concatenate_323", "class_name": "Concatenate", "config": {"name": "concatenate_323", "trainable": true, "axis": -1}, "inbound_nodes": [[["dropout_387", 0, 0, {}], ["concatenate_322", 0, 0, {}]]]}, {"name": "batch_normalization_719", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_719", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concatenate_323", 0, 0, {}]]]}, {"name": "activation_719", "class_name": "Activation", "config": {"name": "activation_719", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_719", 0, 0, {}]]]}, {"name": "conv2d_725", "class_name": "Conv2D", "config": {"name": "conv2d_725", "trainable": true, "filters": 48, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_719", 0, 0, {}]]]}, {"name": "batch_normalization_720", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_720", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_725", 0, 0, {}]]]}, {"name": "activation_720", "class_name": "Activation", "config": {"name": "activation_720", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_720", 0, 0, {}]]]}, {"name": "conv2d_726", "class_name": "Conv2D", "config": {"name": "conv2d_726", "trainable": true, "filters": 12, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_720", 0, 0, {}]]]}, {"name": "dropout_388", "class_name": "Dropout", "config": {"name": "dropout_388", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["conv2d_726", 0, 0, {}]]]}, {"name": "concatenate_324", "class_name": "Concatenate", "config": {"name": "concatenate_324", "trainable": true, "axis": -1}, "inbound_nodes": [[["dropout_388", 0, 0, {}], ["concatenate_323", 0, 0, {}]]]}, {"name": "batch_normalization_721", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_721", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concatenate_324", 0, 0, {}]]]}, {"name": "activation_721", "class_name": "Activation", "config": {"name": "activation_721", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_721", 0, 0, {}]]]}, {"name": "conv2d_727", "class_name": "Conv2D", "config": {"name": "conv2d_727", "trainable": true, "filters": 48, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_721", 0, 0, {}]]]}, {"name": "batch_normalization_722", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_722", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_727", 0, 0, {}]]]}, {"name": "activation_722", "class_name": "Activation", "config": {"name": "activation_722", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_722", 0, 0, {}]]]}, {"name": "conv2d_728", "class_name": "Conv2D", "config": {"name": "conv2d_728", "trainable": true, "filters": 12, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_722", 0, 0, {}]]]}, {"name": "dropout_389", "class_name": "Dropout", "config": {"name": "dropout_389", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["conv2d_728", 0, 0, {}]]]}, {"name": "concatenate_325", "class_name": "Concatenate", "config": {"name": "concatenate_325", "trainable": true, "axis": -1}, "inbound_nodes": [[["dropout_389", 0, 0, {}], ["concatenate_324", 0, 0, {}]]]}, {"name": "batch_normalization_723", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_723", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concatenate_325", 0, 0, {}]]]}, {"name": "activation_723", "class_name": "Activation", "config": {"name": "activation_723", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_723", 0, 0, {}]]]}, {"name": "conv2d_729", "class_name": "Conv2D", "config": {"name": "conv2d_729", "trainable": true, "filters": 48, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_723", 0, 0, {}]]]}, {"name": "batch_normalization_724", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_724", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_729", 0, 0, {}]]]}, {"name": "activation_724", "class_name": "Activation", "config": {"name": "activation_724", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_724", 0, 0, {}]]]}, {"name": "conv2d_730", "class_name": "Conv2D", "config": {"name": "conv2d_730", "trainable": true, "filters": 12, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_724", 0, 0, {}]]]}, {"name": "dropout_390", "class_name": "Dropout", "config": {"name": "dropout_390", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["conv2d_730", 0, 0, {}]]]}, {"name": "concatenate_326", "class_name": "Concatenate", "config": {"name": "concatenate_326", "trainable": true, "axis": -1}, "inbound_nodes": [[["dropout_390", 0, 0, {}], ["concatenate_325", 0, 0, {}]]]}, {"name": "batch_normalization_725", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_725", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concatenate_326", 0, 0, {}]]]}, {"name": "activation_725", "class_name": "Activation", "config": {"name": "activation_725", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_725", 0, 0, {}]]]}, {"name": "conv2d_731", "class_name": "Conv2D", "config": {"name": "conv2d_731", "trainable": true, "filters": 42, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_725", 0, 0, {}]]]}, {"name": "dropout_391", "class_name": "Dropout", "config": {"name": "dropout_391", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["conv2d_731", 0, 0, {}]]]}, {"name": "average_pooling2d_65", "class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_65", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["dropout_391", 0, 0, {}]]]}, {"name": "batch_normalization_726", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_726", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["average_pooling2d_65", 0, 0, {}]]]}, {"name": "activation_726", "class_name": "Activation", "config": {"name": "activation_726", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_726", 0, 0, {}]]]}, {"name": "conv2d_732", "class_name": "Conv2D", "config": {"name": "conv2d_732", "trainable": true, "filters": 48, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_726", 0, 0, {}]]]}, {"name": "batch_normalization_727", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_727", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_732", 0, 0, {}]]]}, {"name": "activation_727", "class_name": "Activation", "config": {"name": "activation_727", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_727", 0, 0, {}]]]}, {"name": "conv2d_733", "class_name": "Conv2D", "config": {"name": "conv2d_733", "trainable": true, "filters": 12, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_727", 0, 0, {}]]]}, {"name": "dropout_392", "class_name": "Dropout", "config": {"name": "dropout_392", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["conv2d_733", 0, 0, {}]]]}, {"name": "concatenate_327", "class_name": "Concatenate", "config": {"name": "concatenate_327", "trainable": true, "axis": -1}, "inbound_nodes": [[["dropout_392", 0, 0, {}], ["average_pooling2d_65", 0, 0, {}]]]}, {"name": "batch_normalization_728", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_728", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concatenate_327", 0, 0, {}]]]}, {"name": "activation_728", "class_name": "Activation", "config": {"name": "activation_728", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_728", 0, 0, {}]]]}, {"name": "conv2d_734", "class_name": "Conv2D", "config": {"name": "conv2d_734", "trainable": true, "filters": 48, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_728", 0, 0, {}]]]}, {"name": "batch_normalization_729", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_729", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_734", 0, 0, {}]]]}, {"name": "activation_729", "class_name": "Activation", "config": {"name": "activation_729", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_729", 0, 0, {}]]]}, {"name": "conv2d_735", "class_name": "Conv2D", "config": {"name": "conv2d_735", "trainable": true, "filters": 12, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_729", 0, 0, {}]]]}, {"name": "dropout_393", "class_name": "Dropout", "config": {"name": "dropout_393", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["conv2d_735", 0, 0, {}]]]}, {"name": "concatenate_328", "class_name": "Concatenate", "config": {"name": "concatenate_328", "trainable": true, "axis": -1}, "inbound_nodes": [[["dropout_393", 0, 0, {}], ["concatenate_327", 0, 0, {}]]]}, {"name": "batch_normalization_730", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_730", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concatenate_328", 0, 0, {}]]]}, {"name": "activation_730", "class_name": "Activation", "config": {"name": "activation_730", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_730", 0, 0, {}]]]}, {"name": "conv2d_736", "class_name": "Conv2D", "config": {"name": "conv2d_736", "trainable": true, "filters": 48, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_730", 0, 0, {}]]]}, {"name": "batch_normalization_731", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_731", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_736", 0, 0, {}]]]}, {"name": "activation_731", "class_name": "Activation", "config": {"name": "activation_731", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_731", 0, 0, {}]]]}, {"name": "conv2d_737", "class_name": "Conv2D", "config": {"name": "conv2d_737", "trainable": true, "filters": 12, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_731", 0, 0, {}]]]}, {"name": "dropout_394", "class_name": "Dropout", "config": {"name": "dropout_394", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["conv2d_737", 0, 0, {}]]]}, {"name": "concatenate_329", "class_name": "Concatenate", "config": {"name": "concatenate_329", "trainable": true, "axis": -1}, "inbound_nodes": [[["dropout_394", 0, 0, {}], ["concatenate_328", 0, 0, {}]]]}, {"name": "batch_normalization_732", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_732", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concatenate_329", 0, 0, {}]]]}, {"name": "activation_732", "class_name": "Activation", "config": {"name": "activation_732", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_732", 0, 0, {}]]]}, {"name": "conv2d_738", "class_name": "Conv2D", "config": {"name": "conv2d_738", "trainable": true, "filters": 48, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_732", 0, 0, {}]]]}, {"name": "batch_normalization_733", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_733", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_738", 0, 0, {}]]]}, {"name": "activation_733", "class_name": "Activation", "config": {"name": "activation_733", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_733", 0, 0, {}]]]}, {"name": "conv2d_739", "class_name": "Conv2D", "config": {"name": "conv2d_739", "trainable": true, "filters": 12, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_733", 0, 0, {}]]]}, {"name": "dropout_395", "class_name": "Dropout", "config": {"name": "dropout_395", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["conv2d_739", 0, 0, {}]]]}, {"name": "concatenate_330", "class_name": "Concatenate", "config": {"name": "concatenate_330", "trainable": true, "axis": -1}, "inbound_nodes": [[["dropout_395", 0, 0, {}], ["concatenate_329", 0, 0, {}]]]}, {"name": "batch_normalization_734", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_734", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concatenate_330", 0, 0, {}]]]}, {"name": "activation_734", "class_name": "Activation", "config": {"name": "activation_734", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_734", 0, 0, {}]]]}, {"name": "conv2d_740", "class_name": "Conv2D", "config": {"name": "conv2d_740", "trainable": true, "filters": 48, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_734", 0, 0, {}]]]}, {"name": "batch_normalization_735", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_735", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_740", 0, 0, {}]]]}, {"name": "activation_735", "class_name": "Activation", "config": {"name": "activation_735", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_735", 0, 0, {}]]]}, {"name": "conv2d_741", "class_name": "Conv2D", "config": {"name": "conv2d_741", "trainable": true, "filters": 12, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_735", 0, 0, {}]]]}, {"name": "dropout_396", "class_name": "Dropout", "config": {"name": "dropout_396", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["conv2d_741", 0, 0, {}]]]}, {"name": "concatenate_331", "class_name": "Concatenate", "config": {"name": "concatenate_331", "trainable": true, "axis": -1}, "inbound_nodes": [[["dropout_396", 0, 0, {}], ["concatenate_330", 0, 0, {}]]]}, {"name": "batch_normalization_736", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_736", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concatenate_331", 0, 0, {}]]]}, {"name": "activation_736", "class_name": "Activation", "config": {"name": "activation_736", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_736", 0, 0, {}]]]}, {"name": "conv2d_742", "class_name": "Conv2D", "config": {"name": "conv2d_742", "trainable": true, "filters": 51, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_736", 0, 0, {}]]]}, {"name": "dropout_397", "class_name": "Dropout", "config": {"name": "dropout_397", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["conv2d_742", 0, 0, {}]]]}, {"name": "average_pooling2d_66", "class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_66", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["dropout_397", 0, 0, {}]]]}, {"name": "batch_normalization_737", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_737", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["average_pooling2d_66", 0, 0, {}]]]}, {"name": "activation_737", "class_name": "Activation", "config": {"name": "activation_737", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_737", 0, 0, {}]]]}, {"name": "conv2d_743", "class_name": "Conv2D", "config": {"name": "conv2d_743", "trainable": true, "filters": 48, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_737", 0, 0, {}]]]}, {"name": "batch_normalization_738", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_738", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_743", 0, 0, {}]]]}, {"name": "activation_738", "class_name": "Activation", "config": {"name": "activation_738", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_738", 0, 0, {}]]]}, {"name": "conv2d_744", "class_name": "Conv2D", "config": {"name": "conv2d_744", "trainable": true, "filters": 12, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_738", 0, 0, {}]]]}, {"name": "dropout_398", "class_name": "Dropout", "config": {"name": "dropout_398", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["conv2d_744", 0, 0, {}]]]}, {"name": "concatenate_332", "class_name": "Concatenate", "config": {"name": "concatenate_332", "trainable": true, "axis": -1}, "inbound_nodes": [[["dropout_398", 0, 0, {}], ["average_pooling2d_66", 0, 0, {}]]]}, {"name": "batch_normalization_739", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_739", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concatenate_332", 0, 0, {}]]]}, {"name": "activation_739", "class_name": "Activation", "config": {"name": "activation_739", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_739", 0, 0, {}]]]}, {"name": "conv2d_745", "class_name": "Conv2D", "config": {"name": "conv2d_745", "trainable": true, "filters": 48, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_739", 0, 0, {}]]]}, {"name": "batch_normalization_740", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_740", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_745", 0, 0, {}]]]}, {"name": "activation_740", "class_name": "Activation", "config": {"name": "activation_740", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_740", 0, 0, {}]]]}, {"name": "conv2d_746", "class_name": "Conv2D", "config": {"name": "conv2d_746", "trainable": true, "filters": 12, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_740", 0, 0, {}]]]}, {"name": "dropout_399", "class_name": "Dropout", "config": {"name": "dropout_399", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["conv2d_746", 0, 0, {}]]]}, {"name": "concatenate_333", "class_name": "Concatenate", "config": {"name": "concatenate_333", "trainable": true, "axis": -1}, "inbound_nodes": [[["dropout_399", 0, 0, {}], ["concatenate_332", 0, 0, {}]]]}, {"name": "batch_normalization_741", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_741", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concatenate_333", 0, 0, {}]]]}, {"name": "activation_741", "class_name": "Activation", "config": {"name": "activation_741", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_741", 0, 0, {}]]]}, {"name": "conv2d_747", "class_name": "Conv2D", "config": {"name": "conv2d_747", "trainable": true, "filters": 48, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_741", 0, 0, {}]]]}, {"name": "batch_normalization_742", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_742", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_747", 0, 0, {}]]]}, {"name": "activation_742", "class_name": "Activation", "config": {"name": "activation_742", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_742", 0, 0, {}]]]}, {"name": "conv2d_748", "class_name": "Conv2D", "config": {"name": "conv2d_748", "trainable": true, "filters": 12, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_742", 0, 0, {}]]]}, {"name": "dropout_400", "class_name": "Dropout", "config": {"name": "dropout_400", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["conv2d_748", 0, 0, {}]]]}, {"name": "concatenate_334", "class_name": "Concatenate", "config": {"name": "concatenate_334", "trainable": true, "axis": -1}, "inbound_nodes": [[["dropout_400", 0, 0, {}], ["concatenate_333", 0, 0, {}]]]}, {"name": "batch_normalization_743", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_743", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concatenate_334", 0, 0, {}]]]}, {"name": "activation_743", "class_name": "Activation", "config": {"name": "activation_743", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_743", 0, 0, {}]]]}, {"name": "conv2d_749", "class_name": "Conv2D", "config": {"name": "conv2d_749", "trainable": true, "filters": 48, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", 